Use [Port]

select * from [dbo].[Port] where Код_порту = 2;

select [Прізвище], [Ім'я], [Номер_телефону] 
from [dbo].[Капітани] LEFT JOIN Перевезення ON
Капітани.Код_капітана = Перевезення.Код_перевезення;

select [Прізвище], [Ім'я], [Номер_телефону] 
from [dbo].[Капітани] INNER JOIN Перевезення ON
Капітани.Код_капітана = Перевезення.Код_перевезення;

select [Перевезення].[Код_перевезення], [Клієнти].[Назва_команії]
from [Перевезення] inner join [Клієнти]
on [Перевезення].[Код_перевезення]=[Клієнти].[Код_клієнта]
WHERE [Назва_команії] = 'Transport1';

SELECT Код_перевезення, Код_клієнта FROM Перевезення 
WHERE NOT EXISTS 
(SELECT * FROM Клієнти WHERE Перевезення.Код_клієнта = Клієнти.Код_клієнта);

SELECT TOP 1 Перевезення.Код_перевезення, Перевезення.Код_клієнта, Клієнти.Код_клієнта, Клієнти.Назва_команії
FROM Перевезення INNER JOIN Клієнти
ON  Перевезення.Код_перевезення = Клієнти.Код_клієнта 
WHERE  Перевезення.Код_перевезення IN 
(SELECT  Перевезення.Код_перевезення FROM Перевезення
WHERE Код_перевезення = 1) 
ORDER BY Перевезення.Код_перевезення DESC;

select Код_клієнта, Назва_команії from Клієнти
Where Код_клієнта<6;