Use [Port]

SELECT Код_капітана, Прізвище, [Ім'я] 
FROM Капітани WHERE Прізвище LIKE '%а%' 
ORDER BY Прізвище ASC;

Use [Port]
SELECT Код_капітана, Прізвище, [Ім'я]
FROM Капітани ORDER BY Код_капітана DESC;

Use [Port]
SELECT  Капітани.Код_капітана, Перевезення.Код_капітана
FROM Капітани JOIN Перевезення ON Перевезення.Код_капітана = Капітани.Код_капітана;

Use [Port]
SELECT  COUNT(Перевезення.Код_перевезення) AS Код_клієнта, Капітани.Код_капітана
FROM Перевезення JOIN Капітани ON Перевезення.Код_перевезення = Капітани.Код_капітана
GROUP BY Капітани.Код_капітана;


