--Use [Port]
--SELECT COUNT([Капітани].[Код_капітана]) AS Код_капітана FROM [Капітани]
--WHERE [Ім'я] = 'Роман';

--Use [Port]
--SELECT YEAR([Капітани].Дата_народження) AS Рік, MONTH([Капітани].Дата_народження) AS Місяць, COUNT([Ім'я]) AS Капітани
--FROM Капітани GROUP BY YEAR([Капітани].Дата_народження), MONTH([Капітани].Дата_народження) WITH ROLLUP;

--SELECT Капітани.Прізвище AS Капітан, AVG(LEN([Ім'я])) AS Середнє
--FROM Капітани
--GROUP BY Капітани.Прізвище;

Use [Port]
SELECT TOP 1 [Капітани].[Код_капітана], COUNT([Перевезення].[Код_перевезення]) AS Кількість_рейсів FROM [Капітани]
JOIN [Перевезення] ON [Капітани].[Код_капітана] = [Перевезення].[Код_перевезення]
GROUP BY [Капітани].[Код_капітана]
ORDER BY COUNT([Перевезення].[Код_перевезення]) Desc;
